app/controllers/doors_controller.rb

SELECT "doors".* FROM "doors" INNER JOIN "doors_users" ON "doors"."id" = "doors_users"."door_id" WHERE "doors_users"."user_id" = ?  [["user_id", 1]]
---
	def index
		@user = current_user
		@doors = @user.doors.all

INSERT INTO "doors" ("country", "state", "city", "street", "street_number", "zipcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = current_user
		@door = @user.doors.create(door_params)

SELECT  "doors".* FROM "doors" WHERE "doors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@door = Door.find(params[:id])

SELECT  "doors".* FROM "doors" WHERE "doors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "doors" SET "country" = ?, "state" = ?, "city" = ?, "street" = ?, "street_number" = ?, "zipcode" = ?, "updated_at" = ? WHERE "doors"."id" = ?  [["country", "United States"], ["state", "WA"], ["city", "Vancouver"], ["street", "Roosevelt"], ["street_number", "2333"], ["zipcode", "55555"], ["updated_at", 2016-12-24 19:10:45 UTC], ["id", 7]]
SELECT "doors".* FROM "doors" INNER JOIN "doors_users" ON "doors"."id" = "doors_users"."door_id" WHERE "doors_users"."user_id" = ?  [["user_id", 1]]
---
	def update
		@door = Door.find(params[:id])
		@user = current_user
		if request.xhr?
			if @door.update(door_params)
				@doors = @user.doors.all

SELECT  "doors".* FROM "doors" WHERE "doors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "doors" WHERE "doors"."id" = ?  [["id", 1]]
---
	def destroy
		door = Door.find(params[:id])
		if door.destroy