app/controllers/users_controller.rb

	def show
		if logged_in?
			@user = current_user
			@doors = @user.doors.all
---
SELECT "doors".* FROM "doors" INNER JOIN "doors_users" ON "doors"."id" = "doors_users"."door_id" WHERE "doors_users"."user_id" = ?  [["user_id", 1]]

	def create
		user = User.new(email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation])
		if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)